Pandas adalah library Python untuk memanipulasi dan menganalisis data berbentuk tabel (seperti Excel). Format datanya disebut DataFrame, mirip seperti tabel Excel: baris dan kolom.

In [6]:
import random

In [8]:
import pandas as pd

In [ ]:
data = {
    'Nama': ['Ali', 'Budi', 'Citra', 'Ridho','Rasyid','Muhammad'], 
    'Umur': [23, 25, 22, 30, 31, 32],
    'Kota': ['Jakarta', 'Bandung', 'Surabaya',"Malang", 'Padang','Banyuwangi']
}


# Ini adalah dictionary (kamus) Python.
# Key-nya ('Nama', 'Umur', 'Kota') akan jadi nama kolom
# Value-nya (daftar/list) akan jadi isi data di kolom itu

df = pd.DataFrame(data)
print(df)

# df = DataFrame = tabel
# Angka di paling kiri (0, 1, 2) = index baris

       Nama  Umur        Kota
0       Ali    23     Jakarta
1      Budi    25     Bandung
2     Citra    22    Surabaya
3     Ridho    30      Malang
4    Rasyid    31      Padang
5  Muhammad    32  Banyuwangi

In [ ]:
df.head()        # Lihat 5 baris pertama

    Nama  Umur      Kota
0    Ali    23   Jakarta
1   Budi    25   Bandung
2  Citra    22  Surabaya

In [12]:
df.tail(2)       # Lihat 2 baris terakhir

    Nama  Umur      Kota
1   Budi    25   Bandung
2  Citra    22  Surabaya

In [16]:
df.info()        # Ringkasan kolom dan tipe data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nama    6 non-null      object
 1   Umur    6 non-null      int64
 2   Kota    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [17]:
df.describe()    # Statistik ringkas untuk angka

            Umur
count   6.000000
mean   27.166667
std     4.355074
min    22.000000
25%    23.500000
50%    27.500000
75%    30.750000
max    32.000000

In [ ]:
# Akses satu kolom, outputnya Name: Nama, dtype: object
# Hasilnya berupa Series, yaitu satu kolom beserta indeksnya
df['Nama']

0         Ali
1        Budi
2       Citra
3       Ridho
4      Rasyid
5    Muhammad
Name: Nama, dtype: object

In [ ]:
# Akses beberapa kolom
# Harus pakai dua tanda kurung siku karena kita ambil lebih dari satu kolom → bentuknya list di dalam list: [['col1', 'col2']]

df[['Nama', 'Umur']]

       Nama  Umur
0       Ali    23
1      Budi    25
2     Citra    22
3     Ridho    30
4    Rasyid    31
5  Muhammad    32

In [31]:
# Mengakses Baris dengan .iloc[] (berdasarkan posisi)
# df.iloc[0] → Ambil baris pertama
# iloc = "index location" (berbasis angka)
# Hasilnya berupa Series, 1 baris data beserta nama kolom

df.iloc[0]

Nama        Ali
Umur         23
Kota    Jakarta
Name: 0, dtype: object

In [ ]:
# # Akses nilai spesifik
df.iloc[2, 2]  # Baris ke-2, Kolom ke-2
# output surabaya karena surabaya berada pada baris ke 2 dan kolom ke

'Jakarta'

In [ ]:
# # Filter (baris dengan umur > 23)
df[df['Umur'] > 23]
df[df['Kota'] == 'Jakarta'] # baris dengan filter kota jakarta

  Nama  Umur     Kota
0  Ali    23  Jakarta

In [ ]:
#  Membuat Series – struktur data 1 dimensi

# Kenapa pakai Series?
    # Series dipakai kalau kamu cuma punya 1 kolom data (misalnya: umur, harga, berat badan).
    # Mirip kolom di Excel, tapi 1 dimensi aja.

data_umur = pd.Series([23, 25, 22])
print(data_umur)

# pd.Series(...) → membuat struktur data seperti list tapi ada index (nomor baris)
# [23, 25, 22] → daftar data umur

0    23
1    25
2    22
dtype: int64

In [ ]:
# Mengambil beberapa baris sekaligus:

print(df.iloc[0:2])

# Penjelasan:
# [0:2] → slicing: mulai dari index ke-0 sampai sebelum index ke-2
# Hasilnya adalah DataFrame dengan 2 baris pertama

   Nama  Umur     Kota
0   Ali    23  Jakarta
1  Budi    25  Bandung

In [ ]:
# Akses Baris berdasarkan Label dengan .loc[]

print(df.loc[1])

# Penjelasan:
# .loc[] = location by label (nama index)
# Karena index-nya default (0, 1, 2), maka df.loc[1] hasilnya sama dengan df.iloc[1]
# ambil baris pertama

Nama       Budi
Umur         25
Kota    Bandung
Name: 1, dtype: object

MODUL 3: Transformasi & Pembersihan Data (Data Cleaning)
 Tujuan:
1. Menambahkan, mengubah, dan menghapus kolom
2. Menangani data kosong (NaN)
3. Mengubah tipe data kolom

In [73]:

data_2 = {
    'Nama': ['Ali', 'Budi', 'Citra'],
    'Umur': [23, 25, None],
    'Kota': ['Jakarta', 'Bandung', None]
}

df2 = pd.DataFrame(data_2)
print(df2)

    Nama  Umur     Kota
0    Ali  23.0  Jakarta
1   Budi  25.0  Bandung
2  Citra   NaN     None

In [74]:
# 1. Menambah Kolom Baru
df2['Gaji'] = [5_000_000, 6_000_000, 4_500_000]
df2['Pekerjaan'] = ['Developer','Analis','Dosen']

print(df2)

    Nama  Umur     Kota     Gaji  Pekerjaan
0    Ali  23.0  Jakarta  5000000  Developer
1   Budi  25.0  Bandung  6000000     Analis
2  Citra   NaN     None  4500000      Dosen

In [75]:
# Mengubah Nilai Kolom (Transformasi)
# Contoh: Tambahkan 1 tahun ke umur semua orang

df2['Umur'] = df2['Umur'] + 1
print(df2)
#  Penjelasan:
    #  Operasi ini diterapkan ke seluruh kolom 'Umur'
    # Nilai NaN tetap jadi NaN (karena operasi matematika pada NaN → hasilnya tetap NaN)

    Nama  Umur     Kota     Gaji  Pekerjaan
0    Ali  24.0  Jakarta  5000000  Developer
1   Budi  26.0  Bandung  6000000     Analis
2  Citra   NaN     None  4500000      Dosen

In [63]:
# Menghapus Kolom

df2['Gaji'] = [5_000_000, 6_000_000, 4_500_000]
print(df2)

df2.drop(columns ='Pekerjaan', inplace=True)
print(df2)

# Penjelasan:
# drop() = menghapus kolom atau baris
# columns='Pekerjaan' → hapus kolom "Pekerjaan"
# inplace=True → langsung mengubah df tanpa harus assign ke variabel baru

    Nama  Umur     Kota  Pekerjaan     Gaji
0    Ali  24.0  Jakarta  Developer  5000000
1   Budi  26.0  Bandung     Analis  6000000
2  Citra   NaN     None      Dosen  4500000
    Nama  Umur     Kota     Gaji
0    Ali  24.0  Jakarta  5000000
1   Budi  26.0  Bandung  6000000
2  Citra   NaN     None  4500000

In [65]:
# cek nilai kosong

print(df2.isnull().sum())
print(df.isnull().sum())

Nama    0
Umur    1
Kota    1
Gaji    0
dtype: int64
Nama    0
Umur    0
Kota    0
dtype: int64

In [ ]:
# Mengisi nilai kosong (fillna)
df2['Umur'].fillna(0, inplace=True)
df2['Kota'].fillna('Tidak diketahui', inplace=True)
print(df2)

df_replace = df2.replace ({'Umur': {0: 28}})
print(df_replace)

df_replace.replace ({'Kota': {'Tidak diketahui': 'Semarang'}}, inplace=True)
print(df_replace)

# inplace=True → langsung mengubah df tanpa harus assign ke variabel baru

    Nama  Umur             Kota     Gaji  Pekerjaan
0    Ali  24.0          Jakarta  5000000  Developer
1   Budi  26.0          Bandung  6000000     Analis
2  Citra   0.0  Tidak diketahui  4500000      Dosen
    Nama  Umur             Kota     Gaji  Pekerjaan
0    Ali  24.0          Jakarta  5000000  Developer
1   Budi  26.0          Bandung  6000000     Analis
2  Citra  28.0  Tidak diketahui  4500000      Dosen
    Nama  Umur      Kota     Gaji  Pekerjaan
0    Ali  24.0   Jakarta  5000000  Developer
1   Budi  26.0   Bandung  6000000     Analis
2  Citra  28.0  Semarang  4500000      Dosen

C:\Users\rasyi\AppData\Local\Temp\ipykernel_14448\1144406360.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Umur'].fillna(0, inplace=True)
C:\Users\rasyi\AppData\Local\Temp\ipykernel_14448\1144406360.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Kota'].fillna('Tidak diketahui', inplace=True)

In [91]:
# Menghapus baris yang memiliki nilai kosong

data = {
    'Nama': ['Ali', 'Budi', 'Citra'],
    'Umur': [23, 25, None],
    'Kota': ['Jakarta', 'Bandung', None]
}
df3 = pd.DataFrame(data)
print(df3)

df3.dropna(inplace=True)
print(df3)

# Penjelasan:
# dropna() → hapus baris yang ada NaN-nya
# Cocok untuk data yang tidak bisa diberi nilai default

    Nama  Umur     Kota
0    Ali  23.0  Jakarta
1   Budi  25.0  Bandung
2  Citra   NaN     None
   Nama  Umur     Kota
0   Ali  23.0  Jakarta
1  Budi  25.0  Bandung

In [ ]:
# Mengubah Tipe Data Kolom

df3['Umur'] = df['Umur'].astype(int) # data sebelumnya float diubah ke integer
print(df3)

   Nama  Umur     Kota
0   Ali    24  Jakarta
1  Budi    26  Bandung

MODUL 4: Grouping, Aggregasi, dan Join Data

🎯 Tujuan:
- Mengelompokkan data (groupby)
- Menghitung agregasi seperti sum(), mean(), count()
- Menggabungkan dua DataFrame (merge / join)

In [102]:
data_karyawan = {
    'Nama': ['Ali', 'Budi', 'Citra', 'Dina', 'Eka'],
    'Cabang': ['Jakarta', 'Bandung', 'Jakarta', 'Bandung', 'Surabaya'],
    'Gaji': [5_000_000, 6_000_000, 5_500_000, 6_500_000, 4_500_000]
}

df4 = pd.DataFrame(data_karyawan)
print(df4)

    Nama    Cabang     Gaji
0    Ali   Jakarta  5000000
1   Budi   Bandung  6000000
2  Citra   Jakarta  5500000
3   Dina   Bandung  6500000
4    Eka  Surabaya  4500000

In [118]:
#  1. Grouping (groupby)

rata2_gaji = df4.groupby('Cabang')['Gaji'].mean()
print(rata2_gaji)

max_gaji = df4.groupby('Cabang')['Gaji'].max()
print(max_gaji)

# Penjelasan:
# .groupby('Cabang') → kelompokkan data berdasarkan kolom 'Cabang'
# ['Gaji'] → fokus hanya pada kolom "Gaji"
# .mean() → hitung rata-rata untuk tiap grup

Cabang
Bandung     6250000.0
Jakarta     5250000.0
Surabaya    4500000.0
Name: Gaji, dtype: float64
Cabang
Bandung     6500000
Jakarta     5500000
Surabaya    4500000
Name: Gaji, dtype: int64

In [119]:
# count and sum

# Jumlah karyawan per cabang

print(df4.groupby('Cabang')['Nama'].count())

# Total gaji per cabang
print(df4.groupby('Cabang')['Gaji'].sum().astype(float)) # ubah hasil integer ke float

Cabang
Bandung     2
Jakarta     2
Surabaya    1
Name: Nama, dtype: int64
Cabang
Bandung     12500000.0
Jakarta     10500000.0
Surabaya     4500000.0
Name: Gaji, dtype: float64

In [120]:
# Agregasi multiple

print(df4.groupby('Cabang')['Gaji'].agg(['min', 'max', 'mean','median']))

              min      max       mean     median
Cabang
Bandung   6000000  6500000  6250000.0  6250000.0
Jakarta   5000000  5500000  5250000.0  5250000.0
Surabaya  4500000  4500000  4500000.0  4500000.0

In [121]:
gaji_per_cabang = df4.groupby('Cabang')['Gaji'].mean().reset_index()
print(gaji_per_cabang)

     Cabang       Gaji
0   Bandung  6250000.0
1   Jakarta  5250000.0
2  Surabaya  4500000.0

In [122]:
# Merge / Join antar DataFrame

bonus = pd.DataFrame({
    'Nama': ['Ali', 'Budi', 'Citra', 'Dina', 'Eka'],
    'Bonus': [500_000, 600_000, 550_000, 650_000, 400_000]
})

df_merged = pd.merge(df4, bonus, on='Nama')
print(df_merged)

    Nama    Cabang     Gaji   Bonus
0    Ali   Jakarta  5000000  500000
1   Budi   Bandung  6000000  600000
2  Citra   Jakarta  5500000  550000
3   Dina   Bandung  6500000  650000
4    Eka  Surabaya  4500000  400000

In [ ]:
# join left right

# left
df_left = pd.DataFrame({
    'ID': [1, 2, 3],
    'Nama': ['Ali', 'Budi', 'Citra'],
    'State' :['California', 'Madura', 'Jawa']
})

df_right = pd.DataFrame({
    'Nama': ['Ali', 'Citra', 'Dina'],
    'Skor': [80, 90, 70],
    'Tim' : ['A','B','C']
})

hasil = pd.merge(df_left, df_right, on='Nama', how='left')
print(hasil)

# how='left' → ambil semua dari df_left, cocokkan data dari kanan
# Budi tidak ada di df_right, maka Skor = NaN

hasil2 = pd.merge(df_right, df_left, on='Nama', how='right')
print(hasil2)

# Budi tidak ada di df_right, maka Skor = NaN

   ID   Nama       State  Skor  Tim
0   1    Ali  California  80.0    A
1   2   Budi      Madura   NaN  NaN
2   3  Citra        Jawa  90.0    B
    Nama  Skor  Tim  ID       State
0    Ali  80.0    A   1  California
1   Budi   NaN  NaN   2      Madura
2  Citra  90.0    B   3        Jawa